Revit 2026 API

# IExternalCommand Methods

---

The IExternalCommand type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Overload this method to implement and external command within Revit. |

#### Reference

IExternalCommand Interface

Autodesk.Revit.UI Namespace